#include <stdio.h>
#include <stdlib.h>

/*
Oд стандарден влез се вчитува еден цел број X, димензии на матрица M и N (цели броеви), како и елементите на матрицата со димензии M x N (цели броеви). Да се напише програма што ќе ги промени редиците на матрицата на следниот начин:

Ако збирот на елементите од редот е поголем од X, елементите на тој ред добиваат вредност 1
Ако збирот на елементите од редот е помал од X, елементите на тој ред добиваат вредност -1
Ако збирот на елементите од редот е еднаков на X, елементите на тој ред добиваат вредност 0
Променетата матрица да се испечати на екран.
*/

int main()
{
    int x,m,n,i,j,vkupno;
    scanf("%d",&x);
    scanf("%d %d",&m,&n);
    int a[m][n];
    for(i=0;i<m;i++)
    {
        for(j=0;j<n;j++)
        {
            scanf("%d",&a[i][j]);
        }
    }
    for(i=0;i<m;i++)
    {
        vkupno=0;
        for(j=0;j<n;j++)
        {
            vkupno+=a[i][j];
        }
        if(vkupno>x)
        {
            for(j=0;j<n;j++)
            {
                a[i][j]=1;
            }
        }
        if(vkupno<x)
        {
            for(j=0;j<n;j++)
            {
                a[i][j]=-1;
            }
        }
        if(vkupno==x)
        {
            for(j=0;j<n;j++)
            {
                a[i][j]=0;
            }
        }
    }
    for(i=0;i<m;i++)
    {
        for(j=0;j<n;j++)
        {
            printf("%d ",a[i][j]);
        }
        printf("\n");
    }
    return 0;
}
