#include <stdio.h>
#include <stdlib.h>
#define MAX 100

/*
Да се напише програма во која се вчитува матрица од цели броеви A со N редици и N * 2 колони (N не е поголемо од 50). Програмата треба да ја трансформира вчитаната матрица во нова матрица B, така што сите елементи десно од N-тата колона ќе ги префрли под N-тата редица, односно од матрица со димензија N редици и 2 * N колони ќе се добие матрица со 2 * N редици x N колони.

Пример за N = 3 Влез:

3

1	2	3	4	5	6
7	8	9	10	11	12
13	14	15	16	17	18

Излез:

1	2	3
7	8	9
13	14	15
4	5	6
10	11	12
16	17	18

*/
int main()
{
    int i,j,n,a[MAX][MAX],b[MAX][MAX];
    scanf("%d",&n);
    int p=n,k=0;
    for(i=0;i<n;i++)
    {
        for(j=0;j<2*n;j++)
        {
            scanf("%d",&a[i][j]);
            if(j>=n)
            {
                b[p][k++]=a[i][j];
            }
            else
            {
                b[i][j]=a[i][j];
            }
        }
        k=0;
        p++;
    }
    for(i=0;i<2*n;i++)
    {
        for(j=0;j<n;j++)
        {
            printf("%d ",b[i][j]);
        }
        printf("\n");
    }
    return 0;
}
