#include <stdio.h>
#include <stdlib.h>

/*
Eден природен број e „интересен“ ако неговиот обратен број е деллив со неговиот број на цифри.
Обратен број е бројот составен од истите цифри, но во обратен редослед (на пример, 653 е обратен
број на бројот 356). Од тастатура се внесува природен број n ( n > 9).
Да се најде и отпечати најголемиот природен број помал од n кој што е „интересен“.
Ако внесениот број не е валиден, да се отпечати соодветна порака (Brojot ne e validen).
*/
int main()
{
    int n,i,tmp,br,pom,j;
    scanf("%d",&n);
    if(n>9)
    {
        for(i=n-1;i>0;i--)
        {
            tmp=0;
            pom=i;
            br=0;
            for(j=i;j>0;j/=10)
            {
                br++;
            }
            while(i!=0)
            {
                tmp=tmp*10+i%10;
                i/=10;
            }
            i=pom;
            if(tmp%br==0)
            {
                printf("%d",i);
                break;
            }
        }
    }
    else
    {
        printf("Brojot ne e validen");
    }
    return 0;
}
