#include <stdio.h>
#include <stdlib.h>

/*
Од стандарден влез се читаат непознат број на хексадецимални цифри се
додека не се внесе точка (.). Ваша задача е да го пресметате декадниот 
збир на внесените хексадецимални цифри. Доколку добиениот декаден збир 
е делив со 16 се печати Pogodok. Доколку истиот тој збир покрај што е делив 
со 16 плус завршува на 16 (последните цифри му се 1 и 6),
се печати Poln pogodok инаку се печати самиот збир.
*/
int main()
{
    int n,suma=0;
    while(scanf("%x",&n))
    {
        if(n=='.')
        {
            break;
        }
        suma+=n;
    }
    if( suma%16==0 && (suma%10==6 && (suma/10)%10==1) )
    {
        printf("Poln pogodok");
    }
    else
    {
        if(suma%16==0)
        {
            printf("Pogodok");
        }
        else
        {
            printf("%d",suma);
        }
    }
    return 0;
}
