#include <stdio.h>
#include <stdlib.h>

/*
Од стандарден влез се чита природен број N. 

Потоа од стандарден влез се чита низа од N природни броеви кои претставуваат висини на планини од швајцарските Алпи. 

Густав е искусен планинар и сака да се искачи на сите планини во оваа низа, но тоа го прави во рамки на неколку години.

Процедурата со која Густав планира да ги искачи планините е следната:

Во секоја година тој се искачува прво на првата неискачена планина од почетокот на низата, притоа планина се смета за веќе искачена ако нејзината висина е поставена на -1 во низата;

Добивајќи надеж и храброст, тој се искачува на првата планина што е повисока од претходната што ја искачил;

Постапката продолжува се додека во тековната година Густав стигне до крајот на низата од планини;

Потоа, секоја година Густав ќе се врати на Алпите и ќе ја изминува низата од планини на истиот начин се додека му останале неискачени врвови;

Ваша задача е за секоја година да ги испечатите висините на планините во редоследот како што ќе ги искачи Густав, притоа излезот за секоја година се печати во нов ред.
*/

int main()
{
    int n,i,j,tmp,k,tmp2;
    scanf("%d",&n);
    int a[n];
    for(i=0;i<n;i++)
    {
        scanf("%d",&a[i]);
    }
    for(i=0;;i++)
    {
        tmp=0;
        tmp2=0;
        if(a[i]==-1)
        {
            continue;
        }
        else
        {
            k=i;
            printf("%d ",a[k]);
            for(j=i+1;j<n;j++)
            {
                if(a[j]>a[k] && a[j]!=-1 && a[j]>tmp2)
                {
                    printf("%d ",a[j]);
                    tmp2=a[j];
                    a[j]=-1;
                }
            }
            a[k]=-1;
            printf("\n");
        }
        for(j=0;j<n;j++)
        {
            if(a[j]==-1)
            {
                tmp++;
            }
        }
        if(tmp==n)
        {
            break;
        }
    }
    return 0;
}
