#include <stdio.h>
#include <stdlib.h>

/*
Oд стандарден влез се вчитува еден цел број X, димензии на матрица M и N (цели броеви), како и елементите на матрицата со димензии M x N (цели броеви). Да се напише програма што ќе ги промени колоните на матрицата на следниот начин:

Ако збирот на елементите од колоната е поголем од X, елементите на таа колона добиваат вредност 1
Ако збирот на елементите од колоната е помал од X, елементите на таа колона добиваат вредност -1
Ако збирот на елементите од колоната е еднаков на X, елементите на таа колона добиваат вредност 0
Променетата матрица да се испечати на екран.

Пример.

Влез:

31

4	3 	17	6	5
2	8	16	1	5
7	8	9	5	11
11	14	4	7	10

Излез:

-1	1	1	-1	0
-1	1	1	-1	0
-1	1	1	-1	0
-1	1	1	-1	0
-1	1	1	-1	0

*/

int main()
{
    int m,n,i,j,x,suma;
    scanf("%d",&x);
    scanf("%d %d",&m,&n);
    int a[m][n];
    for(i=0;i<m;i++)
    {
        for(j=0;j<n;j++)
        {
            scanf("%d",&a[i][j]);
        }
    }
    for(j=0;j<n;j++)
    {
        suma=0;
        for(i=0;i<m;i++)
        {
            suma+=a[i][j];
        }
        if(suma>x)
        {
            for(i=0;i<m;i++)
            {
                a[i][j]=1;
            }
        }
        if(suma<x)
        {
            for(i=0;i<m;i++)
            {
                a[i][j]=-1;
            }
        }
        if(suma==x)
        {
            for(i=0;i<m;i++)
            {
                a[i][j]=0;
            }
        }
    }
    for(i=0;i<m;i++)
    {
        for(j=0;j<n;j++)
        {
            printf("%d ",a[i][j]);
        }
        printf("\n");
    }
    return 0;
}
