#include <stdio.h>
#include <stdlib.h>

/*
Да се напише рекурзивна функција која што ќе пресметува збир на сите природни броеви во интервалот меѓу а и b, (а<b, броевите се аргументи во функцијата, а и bне спаѓаат во интервалот).

Од стандарден влез се вчитуваат броеви а и b, а на стандарден излез се печати збирот на сите броеви помеѓу нив.
*/

int zbir(int a, int b)
{
    if(a>b)
    {
        return 0;
    }
    if(a==b)
    {
        return a;
    }
    else
    {
        return a+b+zbir(a+1,b-1);
    }
}
int main()
{
    int a,b;
    scanf("%d %d",&a,&b);
    printf("%d",zbir(a+1,b-1));
    return 0;
}
