#include <stdio.h>
#include <stdlib.h>

/*
Една еднодимензионална низа се нарекува ребреста, ако секој елемент кој има претходник и 
следбеник е или строго поголем од двата (и од претходникот и од следбеникот) или е строго помал од двата. 
За внесена еднодимензионална низа, со должина n (2 < n < 100), да се утврди дали таа е ребреста или не е.
*/

int main()
{
    int n,i;
    scanf("%d",&n);
    int a[n];
    for(i=0;i<n;i++)
    {
        scanf("%d",&a[i]);
    }
    int br=1;
    for(i=1;i<n-1;i++)
    {
        if( ( a[i-1]>a[i]&&a[i]<a[i+1] ) || ( a[i-1]<a[i] && a[i]>a[i+1] ))
        {
           continue;
        }
        else
        {
            br=0;
            break;
        }
    }
    if(br)
    {
        printf("DA");
    }
    else
    {
        printf("NE");
    }
    return 0;
}
