#include <stdio.h>
#include <stdlib.h>

/*
Од тастатура во низа се внесуваат N позитивни цели броеви (N <= 100), а потоа се внесува и цел број ind (ind >= 0).

Да се напише функција sum_pos која ја прима низата, бројот ind (кој претставува индекс во низата) и бројот на валидни елементи во низата. Функцијата треба да врати сумата на сите елементи почнувајќи од дадениот индекс ind па се до крајот на низата. Ако индексот ind е поголем од Nфункцијата треба да врати 0.

_НАПОМЕНА:_ Задачата да се реши со помош на покажувачи (без користење на оператор [ ]).
*/

int sum(int *pos, int ind, int n)
{
    if(ind>n)
    {
        return 0;
    }
    int i,sum=0;
    for(i=ind;i<n;i++)
    {
        sum+=*(pos+i);
    }
    return sum;
}
int main()
{
    int i,n,ind;
    scanf("%d",&n);
    int a[n];
    for(i=0;i<n;i++)
    {
        scanf("%d",&a[i]);
    }
    scanf("%d",&ind);
    printf("%d",sum(a,ind,n));
    return 0;
}
