#include <stdio.h>
#include <stdlib.h>
#include <math.h>


/*
Од стандарден влез се читаат цели броеви се додека се прочита нешто што не е број или цел број што е помал или еднаков на 1. 

Ваша задача е да проверите за секој од тие броеви дали е прост или сложен преку имплементирање на рекурзивната функција isPrime која како аргумент треба да го прима само целиот број кој се испитува. Функцијата треба да враќа 1 или 0 во зависност од типот на бројот.

Се печати P на местото на простите броеви, а S за сложените.

Рекурзивната дефиниција на правилото за прости броеви е следната: Еден цел број n е прост ако нема прости делители помеѓу 2 и n−−√. 

За да проверите дали делителот е прост број да се повика функцијата isPrime рекурзивно.
*/

int i;

int isPrime(int n)
{
    if(i==1)
    {
        return 1;
    }
    if( !(n%i) )
    {
        return 0;
    }
    i--;
    return isPrime(n);
}
int main()
{
    int n;
    while(1)
    {
        if( scanf("%d",&n)!=1 || n<=1 )
        {
            break;
        }
        i=sqrt(n);
        if(isPrime(n))
        {
            printf("P ");
        }
        else
        {
            printf("S ");
        }
    }
    return 0;
}
