#include <stdio.h>
#include <stdlib.h>

/*Од тастатура се внесува низа од целобројни елементи А со должина N ( N <= 100). Да се трансформира низата така што на почеток ќе се преместат сите парни броеви, а после нив ќе следуваат непарните броеви. Редоследот на елементите да не се менува.

Испечатете ги елементите на трансформираната низа во еден ред на стандарден излез разделени со празно место.

Пример:
A[] = {1, 3, 2, 5, 9, 0, 8, 10}
Трансформираната низа ќе биде:
A[] = {2, 0, 8, 10, 1, 3, 5, 9}

A[]={2, 4, 6, 8, 10}
Трансформираната низа ќе биде:
A[] = {2, 4, 6, 8, 10}

A[]={1, 3, 5, 7, 9}
Трансформираната низа ќе биде:
A[] = {1, 3, 5, 7, 9}
*/

int main()
{
    int n,i,br=0,j=0,k=0;
    scanf("%d",&n);
    int a[n],b[n],c[n],d[n];
    for(i=0;i<n;i++)
    {
        scanf("%d",&a[i]);
    }
    for(i=0;i<n;i++)
    {
        if(a[i]%2==0)
        {
            b[j]=a[i];
            br++;
            j++;
        }
        else
        {
            c[k]=a[i];
            k++;
        }
    }
    j=k=0;
    for(i=0;i<n;i++)
    {
        if(br)
        {
            d[i]=b[j];
            br--;
            j++;
        }
        else
        {
            d[i]=c[k];
            k++;
        }
    }
    for(i=0;i<n;i++)
    {
        printf("%d ",d[i]);
    }
    return 0;
}
