#include <stdio.h>
#include <stdlib.h>

/*
Еден елемент од матрица ја дели матрицата на 4 квадранти (прикажани на сликата). Притоа самиот елемент кој ја дели матрицата припаѓа во четвртиот квадрант (-5 во примерот на сликата).

Од стандарден влез се внесува матрица со димензии NxM (1 <= N, M < 100). Потоа се внесуваат два броеви кои претставуваат индекси на еден елемент од матрицата.

Да се најдат сумите на секој од квадрантите и да се испечатат на стандарен излез. Притоа се печати сумата за првиот квадрант, па за вториот, па третиот и на крај за четвртиот. Доколку не може да се креира квадрант, тогаш за сумата на тој квадрант треба да се испечати 0.
*/

int main()
{
    int i,j,m,n;
    scanf("%d %d",&m,&n);
    int a[m][n];
    for(i=0;i<m;i++)
    {
        for(j=0;j<n;j++)
        {
            scanf("%d",&a[i][j]);
        }
    }
    int x,y;
    scanf("%d %d",&x,&y);
    int prv=0,vtor=0,tret=0,cetvrt=0;
    for(i=x;i<m;i++)
    {
        for(j=y;j<n;j++)
        {
            cetvrt+=a[i][j];
        }
    }
    //printf("%d ",cetvrt);
    for(i=0;i<x;i++)
    {
        for(j=y;j<n;j++)
        {
            prv+=a[i][j];
        }
    }
    //printf("%d ",prv);
    for(i=0;i<x;i++)
    {
        for(j=0;j<y;j++)
        {
            vtor+=a[i][j];
        }
    }
    //printf("%d ",vtor);
    for(i=x;i<m;i++)
    {
        for(j=0;j<y;j++)
        {
            tret+=a[i][j];
        }
    }
    //printf("%d ",tret);
    printf("%d %d %d %d",prv,vtor,tret,cetvrt);
    return 0;
}
