#include <stdio.h>
#include <stdlib.h>
/*
Од стандарден влез се читаат два броја M и N, така што М < N.

Да се испечатат сите броеви во интервалот од М до N (не вклучувајќи ги М и N), што го исполнуваат следните својства:

	-се прости броеви (не се делат со никој друг број освен со 1 и со самите себе)
	-содржат барем една цифра која е парен број

На крај да се испечати аритемтичката средина на тие броеви (заокружена на три децимали).

Доколку ниту еден број во зададениот интервал не ги исполнува потребните својства да се испечати порака NEMA.
*/
int main()
{
    int m,n,i,nep,parna,suma=0,k=0,j;
    scanf("%d %d",&m,&n);
    for(i=m+1;i<n;i++)
    {
        nep=0;
        parna=1;
        for(j=2;j<i;j++)
        {
            if(i%j==0)
            {
                nep++;
                break;
            }
        }
        for(j=i;j;j/=10)
        {
            if((j%10)%2==0)
            {
                parna=0;
                break;
            }
        }
        if(nep==0 && parna==0)
        {
            suma+=i;
            k++;
            printf("%d\n",i);
        }

    }
    if(suma)
    {
        printf("%.3f",(float)suma/k);
    }
    else
    {
        printf("NEMA");
    }
    return 0;
}
