#include <stdio.h>
#include <stdlib.h>

/*
Да се напише рекурзивна функција која што за даден број ќе го пресмета збирот на неговите делители.

Од стандарден влез се вчитува број x, па потоа со помош на функцијата се пресметува збирот на неговите делители и истиот се печати на стандарден излез.
*/

int zbir(int n, int i)
{
    if( i==0 ) //Може и обратно да се почне, од 1 па да се зголемува до n. Во овој случај го намалуваме
    {
        if(i>0)
        {
            return i;
        }
        else
        {
            return 0;
        }
    }
    else
    {
        if(n%i==0)
        {
            return i+zbir(n,i-1);
        }
        else
        {
            return zbir(n,i-1);
        }
    }
}


int main()
{
    int x;
    scanf("%d",&x);
    int a=zbir(x,x-1);
    printf("%d",a);
    return 0;
}
