#include <stdio.h>+
#include <stdlib.h>

/*
За квадратна матрица А со димензии n x n, од стандарден влез се внесува бројот n (n > 2) и елементите на матрицата (реални броеви). Нека X e збирот од елементите под главната дијагонала во матрицата А. Нека Y е збирот од елементите под споредната дијагонала во матрицата А. Да се креира нова матрица B на следниот начин:

сите елементи од главната дијагонала во матрицата B треба да имаат вредност X

сите елементи од споредната дијагонала во матрицата B треба да имаат вредност Y

ако даден елемент припаѓа и на главната и на споредната дијагонала во матрицата B, тогаш неговата вредност e X+Y

сите останати елементи во матрицата B имаат вредност 0

Новата матрица B да се испечати на стандарден излез.

ПРИМЕР:

Матрица A

5		5.5	 	 6	     	1.2		2.5
8		95.1	 21.3    	13		0.2
34	 	4.1	 	 37.4	 	22		6
4.1	 	5.5	 	 0.7	 	7		0

Матрица B
110.2		0		0		0		49.5
0			110.2	0		49.5	0
0			0		159.7	0		0
0			49.5	0		110.2	0
49.5		0		0		0		110.2
*/
int main()
{
    int n,i,j;
    scanf("%d",&n);
    float a[n][n];
    float x=0,y=0;
    for(i=0;i<n;i++)
    {
        for(j=0;j<n;j++)
        {
            scanf("%f",&a[i][j]);
            if(j<i)
            {
                x+=a[i][j];
            }
            if((i+j)>=n)
            {
                y+=a[i][j];
            }
        }
    }
    float b[n][n];
    for(i=0;i<n;i++)
    {
        for(j=0;j<n;j++)
        {
            if( i==j )
            {
                if( (i+j)==(n-1) )
                {
                    b[i][j]=x+y;
                }
                else
                {
                    b[i][j]=x;
                }
            }
            else
            {
                if( (i+j)==(n-1) )
                {
                    b[i][j]=y;
                }
                else
                {
                    b[i][j]=0;
                }
            }
        }
    }
    //printf("%f-%f",x,y);
    for(i=0;i<n;i++)
    {
        for(j=0;j<n;j++)
        {
            printf("%.1f ",b[i][j]);
        }
        printf("\n");
    }
}
